parallel_plates/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          0.001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{

    outletLine
    {
        type            sets;
        libs            (sampling);
        enabled         true;
        writeControl    writeTime;
        interpolationScheme cellPoint;
        setFormat       raw;
        
        sets
        (
            outletVertical
            {
                type    uniform;
                axis    y;
                start   (0.99 0 0.00005);
                end     (0.99 0.01 0.00005);
                nPoints 100;
            }
        );
        
        fields          (U p);
    }

    inletPressureAvg
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        enabled         true;
        writeControl    writeTime;
        writeToFile     yes;
        log             true;
        regionType      patch;
        name            inlet;
        operation       areaAverage;
        writeFields     false;
        fields          (p);
    }

    outletPressureAvg
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        enabled         true;
        writeControl    writeTime;
        writeToFile     yes;
        log             true;
        regionType      patch;
        name            outlet;
        operation       areaAverage;
        writeFields     false;
        fields          (p);
    }
}

// ************************************************************************* //
